app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 8]]
---
  def show
    id = params[:id]
    @event = Event.find(id)

SELECT "events".* FROM "events"
SELECT "events".* FROM "events" WHERE ("events"."date" BETWEEN '1995-10-20 00:00:00.000000' AND '2018-10-20 00:00:00.000000')  ORDER BY "events"."date" ASC
SELECT "events".* FROM "events"  ORDER BY "events"."date" ASC
---
  def index
    @sort_options = Event.sort_options

    #load defaults into session
    session[:start] = '' unless session.has_key?  :start
    session[:end]   = '' unless session.has_key?  :end
    session[:sort]  = ['date'] unless session.has_key? :sort

    @start = params[:start] || session[:start]
    @end   = params[:end]   || session[:end]
    @sort  = params[:sort]  || session[:sort]

    @sort  = @sort.keys unless @sort.class == Array

    if @start.blank? or @end.blank?
      @events = Event.all
    else
      @events = Event.where(:date => @start.to_time..@end.to_time)
    end

    @sort.each do |option|
      @events = @events.order(option.to_sym) unless @events.nil? or @events.class == Array

INSERT INTO "events" ("name", "description", "ingredients", "tags", "date") VALUES (?, ?, ?, ?, ?)  [["name", "Test Event Title"], ["description", "Test Event description"], ["ingredients", "Test, text, of, ingredients"], ["tags", ""], ["date", "2017-11-01 00:00:00.000000"]]
---
  def create
    @event = Event.create!(event_params)

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    id = params[:id]
    @event = Event.find(id)

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 23]]
UPDATE "events" SET "description" = ?, "ingredients" = ?, "ethnicity" = ? WHERE "events"."id" = ?  [["description", ""], ["ingredients", ""], ["ethnicity", "--- !ruby/hash-with-ivars:ActionController::Parameters\nelements:\n  Mediterranean: '1'\nivars:\n  :@permitted: true\n"], ["id", 1]]
---
  def update
    @event = Event.find params[:id]
    @event.update_attributes!(event_params)